[
  "What is the baggage allowance for domestic flights? Each passenger is allowed one checked bag up to 23kg and one carry-on bag up to 8kg.",
  "How early should I arrive at the airport before my flight? It is recommended to arrive at least 2 hours before domestic flights and 3 hours before international flights.",
  "Can I change my flight after booking? Yes, you can change your flight up to 24 hours before departure, subject to availability and fare difference.",
  "What items are prohibited in carry-on luggage? Prohibited items include liquids over 100ml, sharp objects, and flammable materials.",
  "How do I check in online? Visit our website or mobile app, enter your booking reference, and follow the instructions to check in online.",
  "What should I do if my flight is delayed or cancelled? You will be notified via email or SMS. You can rebook or request a refund through our customer service.",
  "Are pets allowed on board? Small pets are allowed in the cabin with prior reservation. Larger pets must travel in the cargo hold.",
  "Do you offer special assistance for passengers with reduced mobility? Yes, please contact our support team at least 48 hours before your flight to arrange assistance.",
  "Can I select my seat in advance? Yes, seat selection is available during booking and online check-in, subject to availability.",
  "What is the policy for unaccompanied minors? Children aged 5-12 can travel alone with our unaccompanied minor service. Additional fees apply.",
  "What can I ask the chatbot? You can ask about flight availability, booking flights, checking your bookings, cancelling flights, and general airline FAQs.",
  "Can I book a flight through the chatbot? Yes, you can book flights by providing the flight ID and confirming your booking.",
  "How do I cancel a booking using the chatbot? You can cancel a booking by providing the booking ID and confirming the cancellation.",
  "Can the chatbot help me find flights? Yes, you can search for flights by providing the origin, destination, and departure date.",
  "How do I check my bookings with the chatbot? You can retrieve your bookings by asking for your flight reservations. You can filter by status (booked, cancelled, completed), booking date, or departure date, and navigate through multiple pages if you have many bookings.",
  "Can I filter my bookings when checking them? Yes, you can filter your bookings by status (booked, cancelled, completed), by the date you made the booking, or by the flight departure date. You can also specify how many bookings to show per page.",
  "What booking statuses can I filter by? You can filter by 'booked' (active upcoming bookings), 'cancelled' (bookings you've cancelled), or 'completed' (flights that have already departed).",
  "What information do I need to book a flight? You need the flight ID to book a flight through the chatbot.",
  "Can I change my booking status using the chatbot? Yes, you can update your booking status to cancelled or other statuses as needed."
]